% Аюпова Д.Р.
%Задача №5 - стр.175
% Решить задачу: f(x)=1-2*x1-2*x2-4*x1*x2+10*(x1)^2+2*(x2)^2=>min
% метоами конфигураций, деформированного многогранника, споряженных
% направлений, Розенброка.
%ОТВЕТ: точное решение (0,25;0,75)T
%=======================================================================%

% Вызов функции метода Розенброка
clc; 
clear all;

x0 = [0.1, 0.11];
eps = 10^(-6);

alpha = 3;
beta  = -0.5;

N = 10;

x_result = ROSENBROCK2 (@f, x0, eps, alpha, beta, N);
% Точное решение из учебника 

disp ('The book.s answer:');
x_answer = [0.25, 0.75]';
disp (x_answer);

% Ошибка решения 
disp ('The relative error:');
error = norm( x_result - x_answer );
disp (error);