% Аюпова Д.Р. гр.13345/2
% Метод штрафов
% Задание №9 - стр.291
% Решить задачу f(x) = (x1+4)^2 + (x2-4)^2 => min
% при ограничениях
% 2x1 - x2 <= 2; x1 >= 0; x2 >= 0
% Ответ: в т. А = (0,4)T - условный минимум
% =============================================================%
function xend = penalty (f, g1, g2, g3, x0, r0, C, eps)
    r = r0;
  % Шаг 2
    k = 0;
    
    R_eps = 0.0001;
    alpha = 3;
    beta = -0.5;
    N = 10;
        
    function y = F(x)
        y = f(x) + (r/2) * ((( (g1(x)>0) * g1(x))^2) + ...
                            ( ((g2(x)>0) * g2(x))^2) + ...
                            ( ((g3(x)>0) * g3(x))^2));
    end

    while (1)
        
        % Шаг 3 - В качестве метода решения безусловного экстремума
        % исполььзую метод конфигураций

        
        xend = ROSENBROCK (@F, x0, R_eps, alpha, beta, N);

        
        
        % Шаг 4
        temp = (r/2) * ((( (g1(xend)>0) * g1(xend))^2) + ...
                        ( ((g2(xend)>0) * g2(xend))^2) + ...
                        ( ((g3(xend)>0) * g3(xend))^2));
        if (temp < eps)
            break; 
        else 
            r = r * C;
            k = k + 1;
            x0 = xend;
        end  
    end
    
end





